---
kind: type
id: T:Autodesk.Revit.DB.FamilyElementVisibility
source: html/fae58e2d-817c-77f6-1747-58b0a4e01c7a.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility

Provides access to the visibility parameters of family elements in family document.

## Syntax (C#)
```csharp
public class FamilyElementVisibility : APIObject
```